Test/Jerome_Test/Framework/IIS/xml/notify.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsn="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:m1="http://www.tmforum.org/xsd/WsDgSamples/RequestResponseWithBatchNotification/v1" xmlns:m2="http://www.tmforum.org/xsd/WsDgSamples/TemplateDataRetrievalWithBatchNotification/v1" xmlns:rr="http://www.tmforum.org/xsd/WsDgSamples/RequestResponse/v1" xmlns:obj="http://www.tmforum.org/xsd/WsDgSamples/Common/Object/v1" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/ http://www.tmforum.org/xsd/WsDgSamples/TemplateDataRetrievalWithBatchNotification/v1 ../RequestResponseWithBatchNotification/TemplateDataRetrievalWithBatchNotificationMessagesV1-0.xsd http://docs.oasis-open.org/wsn/b-2 http://docs.oasis-open.org/wsn/b-2.xsd">
  <SOAP-ENV:Header>
    <wsa:To>http://host:port/notificationconsumer/sc</wsa:To>
    <wsa:Action>http://www.tmforum.org/wsdl/WsDgSamples/NotificationConsumer/v1-0/notify</wsa:Action>
    <wsa:RelatesTo>http://host:port/notification-with-subscription-management/1234</wsa:RelatesTo>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <wsn:Notify>
      <wsn:NotificationMessage>
        <wsn:ProducerReference>
          <wsa:Address>http://host:port/notificationconsumer/sc</wsa:Address>
        </wsn:ProducerReference>
        <wsn:Message>
          <m1:batchNotificationMessage>
            <m2:sequence>1</m2:sequence>
            <m2:endOfReply>false</m2:endOfReply>
            <rr:getObjectResponse>
              <rr:listOfObj>
                <obj:obj>
                  <obj:att1>String</obj:att1>
                  <obj:att2>true</obj:att2>
                  <obj:vendorExtension/>
                </obj:obj>
                <obj:obj>
                  <obj:att1>String</obj:att1>
                  <obj:att2>false</obj:att2>
                  <obj:vendorExtension/>
                </obj:obj>
                <obj:obj>
                  <obj:att1>String</obj:att1>
                  <obj:att2>true</obj:att2>
                  <obj:vendorExtension/>
                </obj:obj>
              </rr:listOfObj>
            </rr:getObjectResponse>
          </m1:batchNotificationMessage>
        </wsn:Message>
      </wsn:NotificationMessage>
    </wsn:Notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
